In [ ]:
import pandas as pd
import os
file_names:list[str] = os.listdir('縣市長')
abs_paths:list[str] = []
for name in file_names:
    if '縣表' in name :
        print(os.path.abspath(f'縣市長/{name}'))          
        abs_paths.append(os.path.abspath(f'縣市長/{name}'))
##下載xlrd
for path in abs_paths:
    display(pd.read_excel(path))

In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.164137 -0.471605
1    a  two -0.344940  0.425334
2    b  one -0.472755 -0.138675
3    b  two -2.156823 -0.322679
4    a  one -2.381715 -0.196867

In [2]:

#Series的groupby()
df['data1']

0    0.164137
1   -0.344940
2   -0.472755
3   -2.156823
4   -2.381715
Name: data1, dtype: float64

In [3]:
df['key1']

0    a
1    a
2    b
3    b
4    a
Name: key1, dtype: object

In [4]:
df['data1'].groupby(df['key1']).sum()

key1
a   -2.562517
b   -2.629577
Name: data1, dtype: float64

In [5]:
df['data1'].groupby(df['key1']).mean()

key1
a   -0.854172
b   -1.314789
Name: data1, dtype: float64

In [6]:
df.groupby('key1')['data1'].sum()

key1
a   -2.562517
b   -2.629577
Name: data1, dtype: float64

In [7]:
df.groupby('key1')['data2'].sum()

key1
a   -0.243139
b   -0.461354
Name: data2, dtype: float64

In [8]:
df.groupby('key1')[['data1','data2']].sum()

         data1     data2
key1
a    -2.562517 -0.243139
b    -2.629577 -0.461354

In [9]:

import pandas as pd

df = pd.read_csv('台鐵進站出站人數.csv')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406761 entries, 0 to 406760
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   日期      406761 non-null  object
 1   站名      405059 non-null  object
 2   進站      406761 non-null  int64
 3   出站      406761 non-null  int64
dtypes: int64(2), object(2)
memory usage: 12.4+ MB

In [11]:

df['日期'] = pd.to_datetime(df['日期'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406761 entries, 0 to 406760
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   日期      406761 non-null  datetime64[ns]
 1   站名      405059 non-null  object
 2   進站      406761 non-null  int64
 3   出站      406761 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 12.4+ MB

In [12]:
df1 = df.dropna()
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 405059 entries, 0 to 406760
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   日期      405059 non-null  datetime64[ns]
 1   站名      405059 non-null  object
 2   進站      405059 non-null  int64
 3   出站      405059 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 15.5+ MB

In [13]:
df1

               日期   站名     進站     出站
0      2019-04-23   五權   1312   1357
1      2019-04-23   潭子   2373   2284
2      2019-04-23  頭家厝    455    476
3      2019-04-23   松竹   1052   1032
4      2019-04-23   太原   3106   3079
...           ...  ...    ...    ...
406756 2023-12-31   成功   1229   3101
406757 2023-12-31   彰化  19617  16699
406758 2023-12-31   花壇   1864   1532
406759 2023-12-31   潭子   3517   3091
406760 2023-12-31   景美     26     11

[405059 rows x 4 columns]

In [14]:
df1.groupby('站名')[['進站','出站']].sum()

          進站       出站
站名
七堵   9044563  9115329
三坑   2080517  2140894
三塊厝   786111   824381
三姓橋  1760760  1594509
三民     12535    18652
..       ...      ...
鼓山    469414   476151
龍井    596686   589722
龍泉     24965    30795
龍港     30146    38335
龜山    141198   134504

[240 rows x 2 columns]

In [15]:
all_datas:dict = dict(list(df1.groupby('站名')))

In [16]:
all_datas['七堵']

               日期  站名    進站    出站
231    2019-04-23  七堵  6113  6335
389    2019-04-24  七堵  6139  6371
629    2019-04-25  七堵  6083  6212
865    2019-04-26  七堵  6635  7042
1103   2019-04-27  七堵  4616  4632
...           ...  ..   ...   ...
405727 2023-12-27  七堵  6980  6970
405963 2023-12-28  七堵  6610  6654
406200 2023-12-29  七堵  7704  7741
406438 2023-12-30  七堵  5747  5674
406675 2023-12-31  七堵  5904  4922

[1714 rows x 4 columns]

In [17]:

for name in ['龍泉','龍港','龜山']:
    print(name)

龍泉
龍港
龜山

In [18]:
{name:all_datas[name] for name in ['龍泉','龍港','龜山']}

{'龍泉':                日期  站名  進站   出站
 164    2019-04-23  龍泉   8   12
 420    2019-04-24  龍泉   8    7
 659    2019-04-25  龍泉  10    8
 896    2019-04-26  龍泉  18   16
 1133   2019-04-27  龍泉  16   28
 ...           ...  ..  ..  ...
 405757 2023-12-27  龍泉  14   23
 405991 2023-12-28  龍泉  11   38
 406230 2023-12-29  龍泉  16   72
 406467 2023-12-30  龍泉  27  256
 406707 2023-12-31  龍泉  41  271

 [1712 rows x 4 columns],
 '龍港':                日期  站名  進站  出站
 38     2019-04-23  龍港  27  22
 376    2019-04-24  龍港  15  18
 616    2019-04-25  龍港  24  25
 852    2019-04-26  龍港  26  27
 1089   2019-04-27  龍港  19  32
 ...           ...  ..  ..  ..
 405712 2023-12-27  龍港  26  22
 405950 2023-12-28  龍港  30  32
 406186 2023-12-29  龍港  34  35
 406425 2023-12-30  龍港  65  51
 406663 2023-12-31  龍港  29  61

 [1713 rows x 4 columns],
 '龜山':                日期  站名   進站   出站
 64     2019-04-23  龜山   77   96
 302    2019-04-24  龜山   96  102
 540    2019-04-25  龜山  182  160
 777    2019-04-26  龜山   98  122
 1015   2019-04-27  龜山   75   72
 ...           ...  ..  ...  ...
 405637 2023-12-27  龜山  141   74
 405873 2023-12-28  龜山   52   48
 406111 2023-12-29  龜山  121  114
 406349 2023-12-30  龜山  226  146
 406548 2023-12-31  龜山  214  159

 [1714 rows x 4 columns]}

In [22]:
df1.groupby('站名')[['進站','出站']].agg([('總數','sum'),('平均人數','mean'),('最多','max'),('最少','min')])

          進站                               出站
          總數         平均人數    最多   最少       總數         平均人數    最多   最少
站名
七堵   9044563  5276.874562  7704  141  9115329  5318.161610  8288  210
三坑   2080517  1213.837223  1715   34  2140894  1249.063011  1835   31
三塊厝   786111   458.641190   933   16   824381   480.969078  1013   15
三姓橋  1760760  1027.281214  2125    3  1594509   930.285298  1603   16
三民     12535     7.364865    52    0    18652    10.958872    57    0
..       ...          ...   ...  ...      ...          ...   ...  ...
鼓山    469414   273.870478  2352    9   476151   277.801050  1055   16
龍井    596686   348.328079  2131   36   589722   344.262697  5506   35
龍泉     24965    14.582360   103    0    30795    17.987734   390    1
龍港     30146    17.598365   106    2    38335    22.378867   130    2
龜山    141198    82.379230   389    3   134504    78.473746   287    0

[240 rows x 8 columns]

In [23]:
df1.groupby(['日期','站名'])[['進站','出站']].sum()

                  進站    出站
日期         站名
2019-04-23 七堵   6113  6335
           三坑   1394  1348
           三塊厝   394   396
           三姓橋  1150  1041
           三民      9     7
...              ...   ...
2023-12-31 鼓山    744   752
           龍井    684   588
           龍泉     41   271
           龍港     29    61
           龜山    214   159

[405059 rows x 2 columns]

In [28]:
df1.groupby([df1['日期'].dt.year,'站名'])[['進站','出站']].sum()

               進站       出站
日期   站名
2019 七堵   1512951  1560506
     三坑    342775   347841
     三塊厝   105842   111863
     三姓橋   288098   260777
     三民      2435     2994
...           ...      ...
2023 鼓山    165055   168011
     龍井    155439   157385
     龍泉      6263     8246
     龍港      8662     9633
     龜山     29966    29613

[1193 rows x 2 columns]

In [34]:
df2=df1.groupby([df1['日期'].dt.year,'站名'])[['進站','出站']].agg([('總數','sum'),('平均人數','mean'),('最多','max'),('最少','min')])

In [35]:
df2.stack()

/tmp/ipykernel_490/406340214.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df2.stack()

                        進站            出站
日期   站名
2019 七堵 總數    1.512951e+06  1.560506e+06
        平均人數  5.980043e+03  6.168008e+03
        最多    7.417000e+03  8.078000e+03
        最少    2.103000e+03  2.438000e+03
     三坑 總數    3.427750e+05  3.478410e+05
...                    ...           ...
2023 龍港 最少    8.000000e+00  7.000000e+00
     龜山 總數    2.996600e+04  2.961300e+04
        平均人數  8.209863e+01  8.113151e+01
        最多    2.550000e+02  2.870000e+02
        最少    3.100000e+01  3.300000e+01

[4772 rows x 2 columns]